{"type":"data","nodes":[null,{"type":"data","data":[{"post":1},{"slug":2,"title":3,"date":4,"excerpt":5,"game":6,"tags":7,"content":11},"prisoners-dilemma-strategies","Cooperate or Betray: Strategies in the Prisoner's Dilemma","2024-07-27","An exploration of the most effective strategies in the famous Prisoner's Dilemma, from 'Always Defect' to the surprisingly robust 'Tit-for-Tat'.","prisoners-dilemma",[8,9,10],"Game Theory","Strategy","Cooperation","\u003Ch2>The Setup\u003C/h2>\n\u003Cp>The Prisoner&#39;s Dilemma is a classic problem in game theory. Two members of a criminal gang are arrested and imprisoned in separate cells, with no way to communicate. The prosecutors lack sufficient evidence to convict them on the principal charge, but they have enough to convict both on a lesser charge.\u003C/p>\n\u003Cp>Each prisoner is offered a deal:\u003C/p>\n\u003Cul>\n\u003Cli>If you \u003Cstrong>betray\u003C/strong> your partner (defect) and they stay silent (cooperate), you go free and they get 5 years in prison.\u003C/li>\n\u003Cli>If you both \u003Cstrong>stay silent\u003C/strong> (cooperate), you each get 1 year on the lesser charge.\u003C/li>\n\u003Cli>If you both \u003Cstrong>betray\u003C/strong> each other (defect), you each get 3 years.\u003C/li>\n\u003C/ul>\n\u003Cp>What would you do?\u003C/p>\n\u003Chr>\n\u003Ch3>The &quot;Rational&quot; Choice\u003C/h3>\n\u003Cp>From a purely individualistic standpoint, defecting seems like the best move regardless of what your partner does:\u003C/p>\n\u003Cul>\n\u003Cli>If they cooperate, your best move is to defect (0 years vs. 1 year).\u003C/li>\n\u003Cli>If they defect, your best move is \u003Cem>still\u003C/em> to defect (3 years vs. 5 years).\u003C/li>\n\u003C/ul>\n\u003Cp>This is the &quot;dilemma&quot;: if both prisoners act &quot;rationally&quot; and defect, they both end up with a worse outcome (3 years each) than if they had trusted each other and cooperated (1 year each).\u003C/p>\n\u003Ch3>Strategies in a Repeated Game\u003C/h3>\n\u003Cp>Things get much more interesting when the game is played repeatedly. In this scenario, your reputation matters. Several strategies have been studied:\u003C/p>\n\u003Col>\n\u003Cli>\u003Cstrong>Always Cooperate:\u003C/strong> A &quot;nice&quot; strategy, but very easy to exploit. A defector will win every round against you.\u003C/li>\n\u003Cli>\u003Cstrong>Always Defect:\u003C/strong> A &quot;mean&quot; strategy. It does well against naive cooperators but fails to achieve the mutually beneficial outcomes of cooperation.\u003C/li>\n\u003Cli>\u003Cstrong>Tit-for-Tat:\u003C/strong> This is one of the most famous and effective strategies. It starts by cooperating and then simply copies the opponent&#39;s previous move. It&#39;s &quot;nice&quot; (it starts cooperatively), &quot;retaliatory&quot; (it punishes defection), and &quot;forgiving&quot; (it will cooperate again if the opponent does).\u003C/li>\n\u003Cli>\u003Cstrong>Grudger:\u003C/strong> This strategy starts by cooperating but will defect forever if the opponent defects even once. It&#39;s less forgiving than Tit-for-Tat.\u003C/li>\n\u003C/ol>\n\u003Ch3>Find the Best Strategy\u003C/h3>\n\u003Cp>Which strategy works best? It depends on the opponent! Our interactive Prisoner&#39;s Dilemma simulation lets you play against various computer-controlled opponents, each using a different strategy.\u003C/p>\n\u003Cp>See if you can beat the &quot;Tit-for-Tat&quot; strategy, or discover how quickly the &quot;Grudger&quot; will turn on you. Experimentation is the key to understanding the dynamics of cooperation.\u003C/p>\n"],"uses":{"params":["slug"]}}]}
